Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetDesignElementAndFabricationPartsWithDifferentOffsets
Gets the collection of design elements that failed to convert and the associated set of fabrication parts with different offsets.
Remarks:
This set of element identifiers is only available after the Convert method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
Returns:
A map of design element identifiers that were not converted and the associated set fabrication parts left with different offsets.
Since:
2017

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetDesignElementAndFabricationPartsWithOpenConnectors
Gets the collection of design elements that failed to convert and the associated set of fabrication parts with open connectors.
Remarks:
This set of element identifiers is only available after the Convert method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
Returns:
A map of design element identifiers that were not converted and the associated set fabrication parts left with open connectors.
Since:
2017

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetConvertedFabricationPartsWithInvalidConnections
Gets the collection of converted fabrication parts with invalid connections.
Remarks:
This set of element identifiers is only available after the Convert method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
Since:
2017

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetElementsWithOpenConnector
Gets the set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
Remarks:
This set of element identifiers is only available after the Convert method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
Since:
2017

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetConvertedFabricationParts
Gets the set of element identifiers for newly created fabrication parts.
Remarks:
This set of element identifiers is only available after the Convert method has been invoked.
Since:
2017

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetPartialConvertFailureResults
Gets the partial failure results.
Remarks:
After the Convert method has been invoked and returned the DesignToFabricationConverterResult::Enum::PartialFailure, calls this method to get partial failure results.
Since:
2017

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.Convert(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Int32)
Converts the set of MEP design elements into fabrication parts.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetConvertedFabricationParts to get a set of element identifiers for the newly created fabrication parts.Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetElementsWithOpenConnector to get a set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
selection:
The set of element identifiers to convert from MEP design elements to fabrication parts.
serviceId:
The identifier of the fabrication service.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the selection contains invalid elements to convert.
-or-
the specified fabrication service is not valid for all domains in the selection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
no fabrication configuration is loaded.
Since:
2017

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.#ctor(Autodesk.Revit.DB.Document)
Creates a new instance of the DesignToFabricationConverter class.
document:
A document in which to convert MEP design elements into fabrication parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter
This class represents the MEP design to fabrication part convert tool.
Remarks:
After a new instance of the class is created, call the Convert method to convert the MEP design elements into
fabrication parts. After the convert method has been invoked, query the class to obtain more information about the conversion:
Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetConvertedFabricationParts to get a set of element identifiers for the newly created fabrication parts.Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetElementsWithOpenConnector to get a set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
Since:
2017